jernejp21/Wireless_accelerometer/Transmitter/STM32CubeIDE/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "nRF24L01p.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
enum fifo
{
  FIFO_OK = 0,
  FIFO_EMPTY = 1,
  FIFO_FULL = 2,
};

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LSM6DSL_R_ADD 0xD7
#define LSM6DSL_W_ADD 0xD6

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim21;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM21_Init(void);
/* USER CODE BEGIN PFP */

void Radio_Init(uint8_t *receiver, uint8_t *transmitter);
void Radio_Receive(void);
void Radio_Transmit(uint8_t *package);

void Acc_Init(void);

void FIFO_Init(void);
int FIFO_Write(uint8_t*, uint8_t);
int FIFO_Read(uint8_t*, uint8_t);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

uint8_t transmitter[5] = {0x77, 0xF0, 0xF0, 0xE8, 0xE8};  //This is me, this is my address.
uint8_t receiver[5] = {0xE1, 0xF0, 0xF0, 0xE8, 0xE8};

uint8_t TxSPI[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
uint8_t RxSPI[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

uint8_t settings[14];
uint8_t package[14];
//uint16_t timeStamp[4000];

/* Queue structure */
#define FIFO_ELEMENTS 6000
#define FIFO_SIZE (FIFO_ELEMENTS + 1)
uint8_t FIFO_buffer[FIFO_SIZE];
uint16_t FIFO_head, FIFO_tail;

int counter;
int counter2;

int16_t accx = 0;
int16_t accy = 0;
int16_t accz = 1;

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  RCC->CR &= ~(1 << RCC_CR_MSION_Pos);  //fc:process "Disable" "MSI clock"

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  MX_TIM21_Init();
  /* USER CODE BEGIN 2 */

  // Flush SPI buffer
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);  //fc:middleware "Flush SPI buffer"
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);

  Radio_Init(receiver, transmitter);  //fc:subRoutine Initialise Radio
  Acc_Init();  //fc:subRoutine Initialise accelerometer

  // Start interrupt on TIM2
  NVIC->ISER[0] |= (1 << TIM2_IRQn);  //fc:process "Enable NVIC interrupt" "for TIM2"
  NVIC_SetPriority(TIM2_IRQn, 1);  //fc:middleware "Edit TIM2 priority"
  TIM2->DIER |= (1 << TIM_DIER_CC1IE_Pos);  //fc:process "Enable TIM2 interrupt"
  TIM2->CR1 |= (1 << TIM_CR1_CEN_Pos);  //fc:process "Start TIM2 counter"

  NVIC->ISER[0] |= (1 << TIM21_IRQn);  //fc:process "Enable NVIC interrupt" "for TIM2"
  NVIC_SetPriority(TIM21_IRQn, 3);  //fc:middleware "Edit TIM2 priority"
  TIM21->DIER |= (1 << TIM_DIER_CC1IE_Pos);  //fc:process "Enable TIM21 interrupt"
  TIM21->CR1 |= (1 << TIM_CR1_CEN_Pos);  //fc:process "Start TIM21 counter"

  package[0] = 0x11;
  package[1] = 0x22;
  package[2] = 0x33;
  package[3] = 0x44;
  package[4] = 0x55;

  TxSPI[0] = W_REGISTER(CONFIG);
  TxSPI[1] = 0x3E;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while(1)  //fc:forLoop while(1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    //fc:interrupt "TIM2_IRQHandler" "every 1000 ms"
  }  //fc:end
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLLMUL_4;
  RCC_OscInitStruct.PLL.PLLDIV = RCC_PLLDIV_2;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_I2C1;
  PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
 * @brief I2C1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.Timing = 0x00300F38;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if(HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure Analogue filter
   */
  if(HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure Digital filter
   */
  if(HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
 * @brief SPI1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_SPI1_Init(void)
{

  /* USER CODE BEGIN SPI1_Init 0 */

  /* USER CODE END SPI1_Init 0 */

  /* USER CODE BEGIN SPI1_Init 1 */

  /* USER CODE END SPI1_Init 1 */
  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 7;
  if(HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI1_Init 2 */

  /* USER CODE END SPI1_Init 2 */

}

/**
 * @brief TIM2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_TIM2_Init(void)
{

  /* USER CODE BEGIN TIM2_Init 0 */

  /* USER CODE END TIM2_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM2_Init 1 */

  /* USER CODE END TIM2_Init 1 */
  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 23;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 25641;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if(HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if(HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if(HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM2_Init 2 */

  /* USER CODE END TIM2_Init 2 */

}

/**
 * @brief TIM21 Initialization Function
 * @param None
 * @retval None
 */
static void MX_TIM21_Init(void)
{

  /* USER CODE BEGIN TIM21_Init 0 */

  /* USER CODE END TIM21_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM21_Init 1 */

  /* USER CODE END TIM21_Init 1 */
  htim21.Instance = TIM21;
  htim21.Init.Prescaler = 9999;
  htim21.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim21.Init.Period = 12800;
  htim21.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim21.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if(HAL_TIM_Base_Init(&htim21) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if(HAL_TIM_ConfigClockSource(&htim21, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if(HAL_TIMEx_MasterConfigSynchronization(&htim21, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM21_Init 2 */

  /* USER CODE END TIM21_Init 2 */

}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(CE_GPIO_Port, CE_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : CE_Pin */
  GPIO_InitStruct.Pin = CE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : CS_Pin */
  GPIO_InitStruct.Pin = CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CS_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

void Acc_Init()
{
  TxSPI[0] = 0x10;
  TxSPI[1] = 0x80;
  HAL_I2C_Master_Transmit(&hi2c1, LSM6DSL_W_ADD, TxSPI, 2, 100);

  // Timestamp LSB = 25 us
  TxSPI[0] = 0x5C;
  TxSPI[1] = 0x10;
  HAL_I2C_Master_Transmit(&hi2c1, LSM6DSL_W_ADD, TxSPI, 2, 100);

  // Enable timestamp
  TxSPI[0] = 0x19;
  TxSPI[1] = 0x20;
  HAL_I2C_Master_Transmit(&hi2c1, LSM6DSL_W_ADD, TxSPI, 2, 100);
}

void Radio_Init(uint8_t *receiver, uint8_t *transmitter)
{
  int i;
  // Set RX address for 0th pipe
  TxSPI[0] = W_REGISTER(RX_ADDR_P0);
  for(i = 0; i < 5; i++)
  {
    TxSPI[i + 1] = *(transmitter + i);
  }
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set RX address for 1st pipe
  TxSPI[0] = W_REGISTER(RX_ADDR_P1);
  for(i = 0; i < 5; i++)
  {
    TxSPI[i + 1] = *(receiver + i);
  }
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set TX address. Has to be the same as RX for 0th pipe if acknowledge is enabled.
  TxSPI[0] = W_REGISTER(TX_ADDR);
  for(i = 0; i < 5; i++)
  {
    TxSPI[i + 1] = *(transmitter + i);
  }
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 6, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set 14 bytes for receive for 0th pipe
  TxSPI[0] = W_REGISTER(RX_PW_P0);
  TxSPI[1] = 14;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set 14 bytes for receive for 1st pipe
  TxSPI[0] = W_REGISTER(RX_PW_P1);
  TxSPI[1] = 14;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set RX in turn on
  TxSPI[0] = W_REGISTER(CONFIG);
  TxSPI[1] = 0x3F;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set frequency to 2400 + 76 MHz
  TxSPI[0] = W_REGISTER(RF_CH);
  TxSPI[1] = 76;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set SETUP_RETR register
  TxSPI[0] = W_REGISTER(SETUP_RETR);
  TxSPI[1] = 0x03;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set RF_SETUP register
  TxSPI[0] = W_REGISTER(RF_SETUP);
  TxSPI[1] = 0x08;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Set STATUS register
  TxSPI[0] = W_REGISTER(STATUS);
  TxSPI[1] = 0x70;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Flush RX in TX buffer
  // Flush RX buffer
  TxSPI[0] = FLUSH_RX;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 1, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);
  // Flush TX buffer
  TxSPI[0] = FLUSH_TX;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 1, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

}

void Radio_Receive()
{
  // Read data from nRF
  // 1. read data from RX FIFO
  settings[0] = R_RX_PAYLOAD;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Receive(&hspi1, settings, 14, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // 2. reset RX_DR IRQ flag
  TxSPI[0] = W_REGISTER(STATUS);
  TxSPI[1] = (1 << RX_DR);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);
}

void Radio_Transmit(uint8_t *package)
{
  uint8_t tmp_package[15];
  // CE = 0
  HAL_GPIO_WritePin(CE_GPIO_Port, CE_Pin, GPIO_PIN_RESET);

  // 1. set PRIM_RX to 0 to enable TX mode
  /*TxSPI[0] = W_REGISTER(CONFIG);
   TxSPI[1] = 0x3E;
   HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
   HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
   HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);*/

  // Clear RX_DR, TX_DS, MAX_RT flags
  TxSPI[0] = W_REGISTER(STATUS);
  TxSPI[1] = ((1 << RX_DR) || (1 << TX_DS) || (1 << MAX_RT));
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // Wait 130 us for TX to be enabled
  //HAL_Delay(1);

  // 2. load package to FIFO
  tmp_package[0] = W_TX_PAYLOAD;
  for(int i = 0; i < 14; i++)
  {
    tmp_package[i + 1] = *(package + i);
  }
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, tmp_package, 15, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  // 3. send at least 10 us pulse to CE to start transmitting
  HAL_GPIO_WritePin(CE_GPIO_Port, CE_Pin, GPIO_PIN_SET);
  HAL_Delay(1);
  HAL_GPIO_WritePin(CE_GPIO_Port, CE_Pin, GPIO_PIN_RESET);

  // 4. check if data was received on the other end
  RxSPI[0] = R_REGISTER(STATUS);
  RxSPI[1] = NOP;
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
  HAL_SPI_Transmit(&hspi1, RxSPI, 2, 100);
  HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

  if(RxSPI[0] & (1 << TX_DS))
  {
    // data was transmitted successfully, clear flags
    TxSPI[0] = W_REGISTER(CONFIG);
    TxSPI[1] = ((1 << RX_DR) || (1 << TX_DS) || (1 << MAX_RT));
    HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);
    HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);
  }
  else
  {
    // flush TX FIFO
    TxSPI[0] = FLUSH_TX;
    HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, TxSPI, 1, 100);
    HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);
  }
}

// task 1
// Freq: 52 Hz
void TIM2_IRQHandler(void)  //fc:startStop TIM2_IRQHandler
{
  char fifo_status;
  if(counter < 10000)
  {
    package[0] = 0x28;
    HAL_I2C_Master_Transmit(&hi2c1, LSM6DSL_W_ADD, package, 1, 100);
    HAL_I2C_Master_Receive(&hi2c1, LSM6DSL_R_ADD, package, 6, 100);  //fc:middleware "Get accel data"

    //accx = (package[1] << 8) | package[0];
    //accy = (package[3] << 8) | package[2];
    //accz = (package[5] << 8) | package[4];
    fifo_status = FIFO_Write(package, 6);

    if(fifo_status == FIFO_FULL)
    {
      __asm__("BKPT");
    }

    counter++;
  }
  else
  {
    __asm__("BKPT");
  }

  TIM2->SR = 0;  //fc:process "Clear interrupt flag"
}  //fc:startStop return

// task 2
// Period 4 s
void TIM21_IRQHandler(void)
{
  char fifo_status;
  do
  {
    fifo_status = FIFO_Read(package, 6);

    Radio_Transmit(package);  //fc:subRoutine Radio_Transmit

    /*TxSPI[0] = W_REGISTER(CONFIG);
     TxSPI[1] = 0x3F;  // Enable RX
     HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_RESET);
     HAL_SPI_Transmit(&hspi1, TxSPI, 2, 100);  //fc:middleware "Enable RX on nRF"
     HAL_GPIO_WritePin(CS_GPIO_Port, CS_Pin, GPIO_PIN_SET);

     HAL_GPIO_WritePin(CE_GPIO_Port, CE_Pin, GPIO_PIN_SET);  //fc:middleware "CE to HIGH"*/

  }
  while(fifo_status == FIFO_OK);
  counter2++;

  TIM21->SR = 0;  //fc:process "Clear interrupt flag"
}

void FIFO_Init(void)
{
  FIFO_head = 0;
  FIFO_tail = 0;
}

int FIFO_Write(uint8_t *new, uint8_t size)
{
  for(int i = 0; i < size; i++)
  {
    if(FIFO_head == ((FIFO_tail - 1 + FIFO_SIZE) % FIFO_SIZE))
    {
      return FIFO_FULL; /* Queue Full*/
    }

    FIFO_buffer[FIFO_head] = *(new + i);

    FIFO_head = (FIFO_head + 1) % FIFO_SIZE;
  }

  return FIFO_OK;  // No errors
}

int FIFO_Read(uint8_t *old, uint8_t size)
{
  for(int i = 0; i < size; i++)
  {
    if(FIFO_head == FIFO_tail)
    {
      return FIFO_EMPTY; /* Queue Empty - nothing to get*/
    }

    *(old + i) = FIFO_buffer[FIFO_tail];

    FIFO_tail = (FIFO_tail + 1) % FIFO_SIZE;
  }

  return FIFO_OK;  // No errors
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
